constant/building/radiationProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      radiationProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

radiation on;

radiationModel  fvDOM;

fvDOMCoeffs
{
    nPhi        3;
    nTheta      5;
    tolerance   1e-3;
    maxIter     10;
}


// Number of flow iterations per radiation iteration
solverFreq 10;

absorptionEmissionModel multiBandAbsorptionEmission;

multiBandAbsorptionEmissionCoeffs
{
    absorptivity  (0);
    emissivity    (0);
}

scatterModel    none;

sootModel       none;

// ************************************************************************* //
