constant/domain1/boundaryRadiationProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      boundaryRadiationProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

".*"
{
    type        transparent;

    wallAbsorptionEmissionModel
    {
        type            multiBandAbsorption;
        emissivity      (1);
        absorptivity    (0);
    }
}

"window.*"
{
    type       opaqueDiffusive;

    wallAbsorptionEmissionModel
    {
        type            multiBandAbsorption;
        absorptivity    (0.66);//混凝土
        emissivity      (0.9);
    };
}
"building.*"
{
    type       opaqueDiffusive;

    wallAbsorptionEmissionModel
    {
        type            multiBandAbsorption;
        absorptivity    (0.66);//混凝土
        emissivity      (0.9);
    };
}
glass
{
type      transparent;
    wallAbsorptionEmissionModel
    {
        type            multiBandAbsorption;
        absorptivity    (0.1);
        emissivity      (0.9);
    };
}

surround
{
    type       opaqueDiffusive;
    wallAbsorptionEmissionModel
    {
        type            multiBandAbsorption;
        absorptivity    (0.66);
        emissivity      (0.9);
    };
}
domain1_to_building
{
    type       opaqueDiffusive;
    wallAbsorptionEmissionModel
    {
        type            multiBandAbsorption;
        absorptivity    (0.66);
        emissivity      (0.9);
    };
}
domain1_to_atrium
{
    type       opaqueDiffusive;
    wallAbsorptionEmissionModel
    {
        type            multiBandAbsorption;
        absorptivity    (0.66);
        emissivity      (0.9);
    };
}

domain1_to_floor
{
    type       opaqueDiffusive;
    wallAbsorptionEmissionModel
    {
        type            multiBandAbsorption;
        absorptivity    (0.66);
        emissivity      (0.9);
    };
}

// ************************************************************************* //
