0.orig/building/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0/air";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform ( 0.1 0 0 );

boundaryField
{
    ".*"
    {
        type            noSlip;
    }
		building_inlet
    {
        type            fixedValue;
        value           uniform (0 0 0);
		phi             phi;
    }

	building_outlet
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
        phi             phi;
    }
	/*
		building_inlet
    {
		type            mappedField;
		sampleMode      nearestPatchFace;
		samplePatch 	building_inlet;
		sampleRegion    domain1;
		//offsetMode 		uniform;
		//offset  		(0 0 0);
		//interpolationScheme  cell;
        field           U;              // optional field name
        setAverage      no;             // apply an average value
        average         0;              // average to apply if setAverage
        value          $internalField;		// place holder
		  //      phi             phi;
		//inletValue      uniform  0;
		//Prt             0.85; 
    }
	*/
}


// ************************************************************************* //
