0.orig/atrium/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/air";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -3 0 0 0 0 ];

internalField   uniform 0.01;

boundaryField
{
		window_inlet
	{

        type            fixedValue;
        value           uniform  0.01;
	}
		window_outlet
	{
	   type            inletOutlet;
       value           $internalField;
       inletValue      $internalField;
	}
		/*
		window_inlet
    {
		type            mappedField;
		sampleMode      nearestPatchFace;
		samplePatch 	window_inlet;
		sampleRegion    domain1;
		//offsetMode 		uniform;
		//offset  		(0 0 0);
		//interpolationScheme  cell;
        field           epsilon;              // optional field name
        setAverage      no;             // apply an average value
        average         0;              // average to apply if setAverage
        value           uniform  0.01;		// place holder
		//inletValue      uniform  0.01;
		//Prt             0.85; 
    }
	*/
    glass
    {
        type            epsilonWallFunction;
        value           uniform 0.01;
        inletValue      uniform 0.01;
    }
    atrium_to_building
    {
        type            epsilonWallFunction;
        value           uniform 0.01;
        inletValue      uniform 0.01;
    }
    atrium_to_domain1
    {
        type            epsilonWallFunction;
        value           uniform 0.01;
        inletValue      uniform 0.01;
    }
	    atrium_to_floor
    {
        type            epsilonWallFunction;
        value           uniform 0.01;
        inletValue      uniform 0.01;
    }
}


// ************************************************************************* //
