0.orig/atrium/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/air";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
	    ".*"
    {
        type            nutkWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 0;
    }
		window_inlet
	{
	    type            calculated;
        value           uniform 0;
	}
		window_outlet
	{
	    type            calculated;
        value           uniform 0;
	}

	/*
		window_inlet
    {
		type            mappedField;
		sampleMode      nearestPatchFace;
		samplePatch 	window_inlet;
		sampleRegion    domain1;
		//offsetMode 		uniform;
		//offset  		(0 0 0);
		//interpolationScheme  cell;
        field          nut;              // optional field name
        setAverage      no;             // apply an average value
        average         0;              // average to apply if setAverage
        value           uniform  0;		// place holder
		//inletValue      uniform  0;
		//Prt             0.85; 
    }
	*/

}


// ************************************************************************* //
