0.orig/building/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/solid";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform 293;

boundaryField
{

    ".*"
    {
        type            compressible::turbulentTemperatureRadCoupledMixed;
        value           uniform 293;
        Tnbr            T;
        kappaMethod     fluidThermo;
        qrNbr           qr;
        qr              qr;
        kappa           none;
		thicknessLayers (0.2);//list of thicknesses per layer [m]
		kappaLayers     (0.5);//list of thermal conductivites per layer [W/m/K]
		thermalInertia  true;
    }
		building_inlet
    {
        type            fixedValue;
        value           $internalField;
    }
	building_outlet
	{
        type            zeroGradient;
    }
	/*
		building_inlet
    {
		type            mappedField;
		sampleMode      nearestPatchFace;
		samplePatch 	building_inlet;
		sampleRegion    domain1;
		//offsetMode 		uniform;
		//offset  		(0 0 0);
		//interpolationScheme  cell;
        field           T;              // optional field name
        setAverage      no;             // apply an average value
        average         0;              // average to apply if setAverage
        value           uniform  293;		// place holder
		//inletValue      uniform  0;
		//Prt             0.85; 
    }
	*/

		building_to_floor
    {
        type            compressible::turbulentTemperatureRadCoupledMixed;
        value           uniform 293;
        Tnbr            T;
        kappaMethod     fluidThermo;
        qrNbr           none;
        qr              qr;
        kappa           none;
    }

}


// ************************************************************************* //
