0.orig/domain1/G
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/air";
    object      G;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -3 0 0 0 0];

internalField   uniform 0;

boundaryField
{
   ".*"
    {
        type            calculated;
        value           uniform 0;
    }
		/*
	window_outlet
    {
		type            mappedField;
		sampleMode      nearestPatchFace;
		samplePatch 	window_outlet;//<neighbourRegion>;
		sampleRegion    atrium;// <neighbourRegion>;
		//offsetMode 		uniform;
		//offset  		(0 0 0);
		//interpolationScheme  cell;
        field          G;              // optional field name
        setAverage      no;             // apply an average value
        average         0;              // average to apply if setAverage
        value           uniform  0;		// place holder
		//inletValue      uniform  0;
		//Prt             0.85; 
    }
	*/
}


// ************************************************************************* //
