0.orig/domain1/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/air";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -3 0 0 0 0 ];

internalField   uniform 0.01;//Cmu^0.75 * k^1.5 / L ; L =10 Cmu=0.09

boundaryField
{
    ".*"
    {
        type            inletOutlet;
        value           $internalField;
        inletValue      $internalField;
    }
	".*_inlet"
	{

        type            fixedValue;
        value            $internalField;
	}
	".*_outlet"
	{
	   type            inletOutlet;
       value           $internalField;
       inletValue      $internalField;
	}
	/*
			window_outlet
    {
		type            mappedField;
		sampleMode      nearestPatchFace;
		samplePatch 	window_outlet;
		sampleRegion    atrium;
		//offsetMode 		uniform;
		//offset  		(0 0 0);
		//interpolationScheme  cell;
        field           epsilon;              // optional field name
        setAverage      no;             // apply an average value
        average         0;              // average to apply if setAverage
        value           uniform  0.01;		// place holder
		//inletValue      uniform  0.01;
		//Prt             0.85; 
    }
	*/

	 inlet
    {
        type            fixedValue;
        value           $internalField;
    }
     glass
    {
        type            epsilonWallFunction;
        value           $internalField;
        inletValue      $internalField;;
    }
	 surround
    {
        type            epsilonWallFunction;
        value           $internalField;
        inletValue      $internalField;;
    }
    domain1_to_building
    {
        type            epsilonWallFunction;
        value           $internalField;
        inletValue      $internalField;
    }
    domain1_to_atrium
    {
        type            epsilonWallFunction;
        value           $internalField;
        inletValue      $internalField;
    }
	 domain1_to_floor
    {
        type            epsilonWallFunction;
        value           $internalField;
        inletValue      $internalField;
    }
}


// ************************************************************************* //
