0.orig/floor/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/floor";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform 293;

boundaryField
{

    ".*"
    {
        type            zeroGradient;
        value           uniform 293;
    }
	 ground
    {
        type            externalWallHeatFluxTemperature;
        mode            coefficient;
        Ta              uniform 293;
        h               uniform 1000000;
        thicknessLayers ( 1 2 );
        kappaLayers     ( 100 200 );
        kappaMethod     solidThermo;
        kappa           none;
		emissivity      0.9;
        value           uniform 293;
    }
 
    "floor.*"
    {
        type            compressible::turbulentTemperatureRadCoupledMixed;
        value           uniform 293;
        Tnbr            T;
        kappaMethod     solidThermo;
        qrNbr           qr;
        qr              none;
        kappa           none;
    }
}


// ************************************************************************* //
