system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeatureExtractDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

atrium.stl
{
    #includeEtc "caseDicts/surface/surfaceFeatureExtractDict.cfg"
}
building.stl
{
    #includeEtc "caseDicts/surface/surfaceFeatureExtractDict.cfg"
}
surround.stl
{
    #includeEtc "caseDicts/surface/surfaceFeatureExtractDict.cfg"
}
glass.stl
{
    #includeEtc "caseDicts/surface/surfaceFeatureExtractDict.cfg"
}
window_inlet.stl
{
    #includeEtc "caseDicts/surface/surfaceFeatureExtractDict.cfg"
}
window_outlet.stl
{
    #includeEtc "caseDicts/surface/surfaceFeatureExtractDict.cfg"
}
building_outlet.stl
{
    #includeEtc "caseDicts/surface/surfaceFeatureExtractDict.cfg"
}
building_inlet.stl
{
    #includeEtc "caseDicts/surface/surfaceFeatureExtractDict.cfg"
}
// ************************************************************************* //
