system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(

    // floor
    {
        name    floor;
        type    cellSet;
        action  new;
        source  boxToCell;
        box     (-200 -300 0)(800 300 5);
    }

    {
        name    floor;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        set     floor;
    }

);

// ************************************************************************* //
